Revit 2024 API
RailingType.PrimaryHandrailType Property
 The type of the primary handrail.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public ElementId PrimaryHandrailType { get; set; }
Visual Basic
Public Property PrimaryHandrailType As ElementId
	Get
	Set
Visual C++
public:
property ElementId^ PrimaryHandrailType {
	ElementId^ get ();
	void set (ElementId^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  When setting this property: The handRailTypeId is not a valid hand rail type.
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
RailingType Class
Autodesk.Revit.DB.Architecture Namespace